say '----------------------------------------'
say 'File address.rexx'
say left('ADDRESS',8,' ') '- test' right('1',3,' '),
 ".. PASS - address()" address()
say 'Done address.rexx'
exit 0
