say '----------------------------------------'
say 'File datatyp.rexx'
r=0
/* From:
The REXX Language A Practical Approach to Programming
Second Edition, MICHAEL COWLISHAW, 1990
*/
r=r+rtest("datatype(' 12 ')","\== 'NUM'",1)
r=r+rtest("datatype('')","\== 'CHAR'",2)
r=r+rtest("datatype('123*')","\== 'CHAR'",3)
r=r+rtest("datatype('12.3','N')","\= 1",4)
r=r+rtest("datatype('12.3','W')","\= 0",5)
r=r+rtest("datatype('Fred','M')","\= 1",6)
r=r+rtest("datatype('','M')","\= 0",7)
r=r+rtest("datatype('Minx','L')","\= 0",8)
r=r+rtest("datatype('3d?','s')","\= 1",9)
r=r+rtest("datatype('BCd3','X')","\= 1",10)
r=r+rtest("datatype('BC d3','X')","\= 1",11)
/* From: Mark Hessling */
r=r+rtest("datatype('foobar')","\== 'CHAR'",12)
r=r+rtest("datatype('foo bar')","\== 'CHAR'",13)
r=r+rtest("datatype('123.456.789')","\== 'CHAR'",14)
r=r+rtest("datatype('123.456')","\== 'NUM'",15)
r=r+rtest("datatype('')","\== 'CHAR'",16)
r=r+rtest("datatype('DeadBeef' , 'A')","\== '1'",17)
r=r+rtest("datatype('Dead Beef','A')","\== '0'",18)
r=r+rtest("datatype('1234ABCD','A')","\== '1'",19)
r=r+rtest("datatype('','A')","\== '0'",20)
r=r+rtest("datatype('foobar','B')","\== '0'",21)
r=r+rtest("datatype('01001101','B')","\== '1'",22)
r=r+rtest("datatype('0110 1101','B')","\== '1'",23)
r=r+rtest("datatype('','B')","\== '1'",24)
r=r+rtest("datatype('foobar','L')","\== '1'",25)
r=r+rtest("datatype('FooBar','L')","\== '0'",26)
r=r+rtest("datatype('foo bar','L')","\== '0'",27)
r=r+rtest("datatype('','L')","\== '0'",28)
r=r+rtest("datatype('foobar','M')","\== '1'",29)
r=r+rtest("datatype('FooBar','M')","\== '1'",30)
r=r+rtest("datatype('foo bar','M')","\== '0'",31)
r=r+rtest("datatype('FOOBAR','M')","\== '1'",32)
r=r+rtest("datatype('','M')","\== '0'",33)
r=r+rtest("datatype('foo bar','N')","\== '0'",34)
r=r+rtest("datatype('1324.1234','N')","\== '1'",35)
r=r+rtest("datatype('123.456.789','N')","\== '0'",36)
r=r+rtest("datatype('','N')","\== '0'",37)
r=r+rtest("datatype('foo bar','S')","\== '0'",38)
r=r+rtest("datatype('','S')","\== '0'",39)
r=r+rtest("datatype('foo bar','U')","\== '0'",40)
r=r+rtest("datatype('Foo Bar','U')","\== '0'",41)
r=r+rtest("datatype('FOOBAR','U')","\== '1'",42)
r=r+rtest("datatype('','U')","\== '0'",43)
r=r+rtest("datatype('Foobar','W')","\== '0'",44)
r=r+rtest("datatype('123','W')","\== '1'",45)
r=r+rtest("datatype('12.3','W')","\== '0'",46)
r=r+rtest("datatype('','W')","\== '0'",47)
r=r+rtest("datatype('123.123','W')","\== '0'",48)
r=r+rtest("datatype('123.123E3','W')","\== '1'",49)
r=r+rtest("datatype('123.0000005','W')","\== '0'",50)
r=r+rtest("datatype('123.0000006','W')","\== '0'",51)
r=r+rtest("datatype(' 23','W')","\== '1'",52)
r=r+rtest("datatype(' 23 ','W')","\== '1'",53)
r=r+rtest("datatype('23 ','W')","\== '1'",54)
r=r+rtest("datatype('123.00','W')","\== '1'",55)
r=r+rtest("datatype('123000E-2','W')","\== '1'",56)
r=r+rtest("datatype('123000E+2','W')","\== '1'",57)
r=r+rtest("datatype('Foobar','X')","\== '0'",58)
r=r+rtest("datatype('DeadBeef','X')","\== '1'",59)
r=r+rtest("datatype('A B C','X')","\== '0'",60)
r=r+rtest("datatype('A BC DF','X')","\== '1'",61)
r=r+rtest("datatype('123ABC','X')","\== '1'",62)
r=r+rtest("datatype('123AHC','X')","\== '0'",63)
r=r+rtest("datatype('','X')","\== '1'",64)
r=r+rtest("datatype('0.000E-2','w')","\== '1'",65)
r=r+rtest("datatype('0.000E-1','w')","\== '1'",66)
r=r+rtest("datatype('0.000E0','w')","\== '1'",67)
r=r+rtest("datatype('0.000E1','w')","\== '1'",68)
r=r+rtest("datatype('0.000E2','w')","\== '1'",69)
r=r+rtest("datatype('0.000E3','w')","\== '1'",70)
r=r+rtest("datatype('0.000E4','w')","\== '1'",71)
r=r+rtest("datatype('0.000E5','w')","\== '1'",72)
r=r+rtest("datatype('0.000E6','w')","\== '1'",73)
r=r+rtest("datatype('0E-1','w')","\== '1'",74)
r=r+rtest("datatype('0E0','w')","\== '1'",75)
r=r+rtest("datatype('0E1','w')","\== '1'",76)
r=r+rtest("datatype('0E2','w')","\== '1'",77)
say 'Done datatyp.rexx'
exit r
