say '----------------------------------------'
say 'File digits.rexx'
r=0
/* From:
The REXX Language A Practical Approach to Programming
Second Edition, MICHAEL COWLISHAW, 1990
*/
r=r+rtest("digits()","\= 9",1)
say 'Done digits.rexx'
exit r
