say '----------------------------------------'
say 'File form.rexx'
r=0
/* From:
The REXX Language A Practical Approach to Programming
Second Edition, MICHAEL COWLISHAW, 1990
*/
r=r+rtest("form()","\= 'SCIENTIFIC'",1)
say 'Done form.rexx'
exit r
