say '----------------------------------------'
say 'File random.rexx'
/* RANDOM */
say "Look for RANDOM OK"
/*
From: The REXX Language
      A Practical Approach to Programming
      Second Edition
      MICHAEL COWLISHAW
      1990
*/
say "Values may differ."
say "RANDOM()="random()
say "RANDOM(5,8)="random(5,8)
say "RANDOM(,,1989)="random(,,1989)
say "RANDOM(2)="random(2)
/* These from Mark Hessling. */
say "RANDOM OK"

