say '----------------------------------------'
say 'File x2d.rexx'
r=0
/* From:
The REXX Language A Practical Approach to Programming
Second Edition, MICHAEL COWLISHAW, 1990
*/
r=r+rtest("x2d('0E')","\== 14",1)
r=r+rtest("x2d('81')","\== 129",2)
r=r+rtest("x2d('F81')","\== 3969",3)
r=r+rtest("x2d('FF81')","\== 65409",4)
r=r+rtest("x2d('F0')","\== 240",5)
r=r+rtest("x2d('81',2)","\== -127",6)
r=r+rtest("x2d('81',4)","\== 129",7)
r=r+rtest("x2d('F081',4)","\== -3967",8)
r=r+rtest("x2d('F081',3)","\== 129",9)
r=r+rtest("x2d('F081',2)","\== -127",10)
r=r+rtest("x2d('F081',1)","\== 1",11)
/* From: Mark Hessling */
r=r+rtest("x2d( 'ff80', 2)","\== '-128'",12)
r=r+rtest("x2d( 'ff80', 1)","\== '0'",13)
r=r+rtest("x2d( 'ff 80', 1)","\== '0'",14)
r=r+rtest("x2d( '' )","\== '0'",15)
r=r+rtest("x2d( '101' )","\== '257'",16)
r=r+rtest("x2d( 'ff' )","\== '255'",17)
r=r+rtest("x2d( 'ffff')","\== '65535'",18)
r=r+rtest("x2d( 'ffff', 2)","\== '-1'",19)
r=r+rtest("x2d( 'ffff', 1)","\== '-1'",20)
r=r+rtest("x2d( 'fffe', 2)","\== '-2'",21)
r=r+rtest("x2d( 'fffe', 1)","\== '-2'",22)
r=r+rtest("x2d( 'ffff', 4)","\== '-1'",23)
r=r+rtest("x2d( 'ffff', 2)","\== '-1'",24)
r=r+rtest("x2d( 'fffe', 4)","\== '-2'",25)
r=r+rtest("x2d( 'fffe', 2)","\== '-2'",26)
r=r+rtest("x2d( 'ffff', 3)","\== '-1'",27)
r=r+rtest("x2d( '0fff')","\== '4095'",28)
r=r+rtest("x2d( '0fff', 4)","\== '4095'",29)
r=r+rtest("x2d( '0fff', 3)","\== '-1'",30)
r=r+rtest("x2d( '07ff')","\== '2047'",31)
r=r+rtest("x2d( '07ff', 4)","\== '2047'",32)
r=r+rtest("x2d( '07ff', 3)","\== '2047'",33)
r=r+rtest("x2d( 'ff7f', 1)","\== '-1'",34)
r=r+rtest("x2d( 'ff7f', 2)","\== '127'",35)
r=r+rtest("x2d( 'ff7f', 3)","\== '-129'",36)
r=r+rtest("x2d( 'ff7f', 4)","\== '-129'",37)
r=r+rtest("x2d( 'ff7f', 5)","\== '65407'",38)
r=r+rtest("x2d( 'ff80', 1)","\== '0'",39)
r=r+rtest("x2d( 'ff80', 2)","\== '-128'",40)
r=r+rtest("x2d( 'ff80', 3)","\== '-128'",41)
r=r+rtest("x2d( 'ff80', 4)","\== '-128'",42)
r=r+rtest("x2d( 'ff80', 5)","\== '65408'",43)
r=r+rtest("x2d( 'ff81', 1)","\== '1'",44)
r=r+rtest("x2d( 'ff81', 2)","\== '-127'",45)
r=r+rtest("x2d( 'ff81', 3)","\== '-127'",46)
r=r+rtest("x2d( 'ff81', 4)","\== '-127'",47)
r=r+rtest("x2d( 'ff81', 5)","\== '65409'",48)
r=r+rtest("x2d( 'ffffffffffff', 12)","\== '-1'",49)
r=r+rtest("X2D((1&1|0=22*33))","\== '1'",50)
r=r+rtest("X2D(ABS((1&1|0=22*33)))","\== '1'",51)
r=r+rtest("X2D(RIGHT(LEFT(REVERSE(321),2),REVERSE(LEFT(123,ABS(-1)))))",,
"\== '2'",52)
r=r+rtest("x2d(''X)","\== '0'",53)
r=r+rtest("X2D('a')","\== '10'",54)
r=r+rtest("X2D('0f')","\== '15'",55)
r=r+rtest("x2D('80')","\== '128'",56)
r=r+rtest("x2d('765')","\== '1893'",57)
r=r+rtest("x2d(01234)","\== '4660'",58)
r=r+rtest("x2d(1E2)","\== '482'",59)
r=r+rtest("x2d(baba)","\== '47802'",60)
r=r+rtest("X2D('',0)","\== '0'",61)
r=r+rtest("X2D('',12)","\== '0'",62)
r=r+rtest("X2D('abc',0)","\== '0'",63)
r=r+rtest("X2D('abc',1)","\== '-4'",64)
r=r+rtest("X2D('abc',3)","\== '-1348'",65)
r=r+rtest("X2D('abc',5)","\== '2748'",66)
r=r+rtest("X2D('abc',12345)","\== '2748'",67)
r=r+rtest("x2d(1+3,1+3)","\== '4'",68)
r=r+rtest("x2D(256+12,10+2)","\== '616'",69)
r=r+rtest("x2d('12',987654321)","\== '18'",70)
r=r+rtest("d2x(X2D('12345'))","\== '12345'",71)
r=r+rtest("X2D((00000000000000001+1-0.000000))","\== '2'",72)
r=r+rtest("X2D((99/3+10*126-(33||2)//5-1099))","\== '402'",73)
r=r+rtest("X2D(ABS((99/3+10*126-(33||2)//5-1099)))","\== '402'",74)
r=r+rtest("X2D(COPIES(0,249)||1)","\== '1'",75)
r=r+rtest("X2D(ABS((00000000000000001+1-0.000000)))","\== '2'",76)
r=r+rtest("X2D(ABS(COPIES(0,249)||1))","\== '1'",77)
r=r+rtest("X2D(ABS(RIGHT(LEFT(REVERSE(321),2),REVERSE(LEFT(123,ABS(-1))))))",,
"\== '2'",78)
r=r+rtest("x2D('eeeeeeeeeeeeeeeeeeeeeeeee')",,
"\== '1183140560213014108063589658350'",79)
say 'Done x2d.rexx'
exit r
