/* DEMONSTRATES THE DUMP FUNCTION FOR A VARIABLE        */
LINE='THIS IS THE NEW VERSION OF BREXX/370 V2R1M0'
CALL DUMP LINE
/* DEMONSTRATES THE DUMP FUNCTION MAIN STORAGE ADDRESS  */
CALL STORDUMP 16,64,'CVT 64 BYTES'
