/* ---------------------------------------------------------------------
 * Example TIMEs                                    PEJ 3. December 2018
 * ---------------------------------------------------------------------
 */
say 'Time Now     : 'time('L')
say 'Elapsed Time : 'Time('S') '(since Midnight in seconds)'
