/* ---------------------------------------------------------------------
 * Report Information from Datasets or DDN Allocations
 * ---------------------------------------------------------------------
 */
SAY RXDSINFO('SYSPROC','REPORT','DDN')
SAY RXDSINFO('SYSEXEC','REPORT','DDN')
SAY RXDSINFO('BREXX.SRC','REPORT','DSN')
SAY RXDSINFO('SYS2.LINKLIB','REPORT','DSN')
