//ZMG01AP  JOB (BREXX),'ZMG0001',CLASS=A,
//         MSGCLASS=H,MSGLEVEL=(1,1)
//*
//* ZMG0001 (BREXX/370 TSO INTEGRATION) - APPLY
//*
//* RUN ZMG01BK FIRST.  NOTE THE EXTENTS OF SYS1.CMDLIB BEFORE AND
//* COMPARE THEM AFTER: A NEW EXTENT MEANS EXEC CANNOT BE LOADED
//* (IEA703I 106-F) UNTIL THE NEXT IPL.  OTHERWISE NO IPL IS NEEDED.
//* THE LISTING MUST SHOW "HMA2390 LINK SUCCESSFUL" FOR IKJCT430 AND
//* IKJCT437.  DO NOT ACCEPT ZMG0001.
//*
//SMP      EXEC SMPAPP
//HMASMP.CMDLIB   DD DSN=SYS1.CMDLIB,DISP=SHR
//HMASMP.AOST4    DD DSN=SYS1.AOST4,DISP=SHR
//HMASMP.SMPCNTL  DD *
 APPLY SELECT(ZMG0001) .
/*
//
