//DATETEST JOB (BREXX370),CLASS=A,MSGCLASS=H,
//         REGION=8192K,NOTIFY=&SYSUID
//*
//*
//*RELEASE   SET 'V2R2M0'
//* ... BREXX          Version V2R2M0 Build Date 23. Oct 2019
//* ... INSTALLER DATE 27 Oct 2019 09:15:38
//* ------------------------------------------------------------------*
//* TEST REXX DATE IN PLAIN BATCH
//* ------------------------------------------------------------------*
//REXX EXEC RXBATCH,BREXX='BREXX',
//     EXEC='DATE#T',
//     SLIB='BREXX.V2R2M0.SAMPLES'
