//TIMETEST JOB (BREXX370),CLASS=A,MSGCLASS=H,
//         REGION=8192K,NOTIFY=&SYSUID
//*
//*RELEASE   SET 'V2R5M3'
//* ... BREXX          Version V2R5M3 Build Date 01. Feb 2024
//* ... INSTALLER DATE 03/02/2024 17:40:26
//* ------------------------------------------------------------------*
//* TEST REXX DATE AS TSO BATCH
//* ------------------------------------------------------------------*
//REXX EXEC RXTSO,EXEC='$ETIME',SLIB='BREXX.V2R5M3.SAMPLES'
